ir_version: 10
producer_name: "onnxruntime.transformers"
producer_version: "1.21.0"
graph {
  node {
    output: "_to_copy"
    name: "node_Constant_5723"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 7
        name: "_to_copy"
        raw_data: ""
      }
      type: TENSOR
    }
  }
  node {
    output: "val_9"
    name: "node_Constant_36"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "dim_9"
    name: "n4_2_n1_14"
    op_type: "Constant"
    attribute {
      name: "value_int"
      i: 1
      type: INT
    }
  }
  node {
    output: "_to_copy_11"
    name: "node_Constant_5806"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 7
        name: "_to_copy_11"
        raw_data: ""
      }
      type: TENSOR
    }
  }
  node {
    output: "val_120"
    name: "node_Constant_252"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "val_198"
    name: "node_Constant_383"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: -1
      type: INTS
    }
  }
  node {
    output: "val_203"
    name: "node_Constant_388"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_204"
    name: "node_Constant_390"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "val_216"
    name: "node_Constant_403"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "val_254"
    name: "node_Constant_454"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: -1
      type: INTS
    }
  }
  node {
    output: "val_259"
    name: "node_Constant_459"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_264"
    name: "node_Constant_465"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: -1
      type: INTS
    }
  }
  node {
    output: "val_269"
    name: "node_Constant_470"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_366"
    name: "node_Constant_631"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_397"
    name: "node_Constant_666"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_438"
    name: "node_Constant_719"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_500"
    name: "node_Constant_847"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_530"
    name: "node_Constant_881"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_570"
    name: "node_Constant_933"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_632"
    name: "node_Constant_1061"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_662"
    name: "node_Constant_1095"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_702"
    name: "node_Constant_1147"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_764"
    name: "node_Constant_1275"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_794"
    name: "node_Constant_1309"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_834"
    name: "node_Constant_1361"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_896"
    name: "node_Constant_1489"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_926"
    name: "node_Constant_1523"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_966"
    name: "node_Constant_1575"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1028"
    name: "node_Constant_1703"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1058"
    name: "node_Constant_1737"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1098"
    name: "node_Constant_1789"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1160"
    name: "node_Constant_1917"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1190"
    name: "node_Constant_1951"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1230"
    name: "node_Constant_2003"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1292"
    name: "node_Constant_2131"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1322"
    name: "node_Constant_2165"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1362"
    name: "node_Constant_2217"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1424"
    name: "node_Constant_2345"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1454"
    name: "node_Constant_2379"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1494"
    name: "node_Constant_2431"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1556"
    name: "node_Constant_2559"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1586"
    name: "node_Constant_2593"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1626"
    name: "node_Constant_2645"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1688"
    name: "node_Constant_2773"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1718"
    name: "node_Constant_2807"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1758"
    name: "node_Constant_2859"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1820"
    name: "node_Constant_2987"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1850"
    name: "node_Constant_3021"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1890"
    name: "node_Constant_3073"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1952"
    name: "node_Constant_3201"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_1982"
    name: "node_Constant_3235"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2022"
    name: "node_Constant_3287"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2084"
    name: "node_Constant_3415"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2114"
    name: "node_Constant_3449"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2154"
    name: "node_Constant_3501"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2216"
    name: "node_Constant_3629"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2246"
    name: "node_Constant_3663"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2286"
    name: "node_Constant_3715"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2348"
    name: "node_Constant_3843"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2378"
    name: "node_Constant_3877"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2418"
    name: "node_Constant_3929"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2480"
    name: "node_Constant_4057"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2510"
    name: "node_Constant_4091"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2550"
    name: "node_Constant_4143"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2612"
    name: "node_Constant_4271"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2642"
    name: "node_Constant_4305"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2682"
    name: "node_Constant_4357"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2744"
    name: "node_Constant_4485"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2774"
    name: "node_Constant_4519"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2814"
    name: "node_Constant_4571"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2876"
    name: "node_Constant_4699"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2906"
    name: "node_Constant_4733"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_2946"
    name: "node_Constant_4785"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3008"
    name: "node_Constant_4913"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3038"
    name: "node_Constant_4947"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3078"
    name: "node_Constant_4999"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3140"
    name: "node_Constant_5127"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3170"
    name: "node_Constant_5161"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3210"
    name: "node_Constant_5213"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3272"
    name: "node_Constant_5341"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3302"
    name: "node_Constant_5375"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3342"
    name: "node_Constant_5427"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3404"
    name: "node_Constant_5555"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3434"
    name: "node_Constant_5589"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "val_3474"
    name: "node_Constant_5641"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "audio_attention_mask"
    output: "convert_element_type_default"
    name: "node_Cast_132"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "audio_embeds"
    output: "val_0"
    name: "node_Shape_0"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 1
      type: INT
    }
    attribute {
      name: "start"
      i: 0
      type: INT
    }
  }
  node {
    input: "audio_embeds"
    output: "val_1"
    name: "node_Shape_2"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
  }
  node {
    input: "audio_projection_mode"
    input: "_to_copy_40"
    output: "eq_4297"
    name: "node_Equal_5697"
    op_type: "Equal"
  }
  node {
    input: "audio_sizes"
    input: "dim_0_20"
    output: "unsqueeze_19"
    name: "n2_32"
    op_type: "Unsqueeze"
  }
  node {
    input: "audio_embeds"
    input: "encoder.encoder_embedding.global_mean"
    output: "sub"
    name: "node_Sub_4"
    op_type: "Sub"
  }
  node {
    input: "convert_element_type_default"
    input: "val_61"
    output: "sum_1"
    name: "node_ReduceSum_137"
    op_type: "ReduceSum"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
    attribute {
      name: "noop_with_empty_axes"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_0"
    output: "sym_size_int_473"
    name: "node_Squeeze_1"
    op_type: "Squeeze"
  }
  node {
    input: "val_1"
    output: "sym_size_int_474"
    name: "node_Squeeze_3"
    op_type: "Squeeze"
  }
  node {
    input: "eq_4297"
    output: "getitem_96"
    name: "node_If_5698"
    op_type: "If"
    attribute {
      name: "else_branch"
      g {
        node {
          input: "view_104"
          input: "audio_projection.vision.0.weight_Q4"
          input: "audio_projection.vision.0.weight_scales"
          output: "val_1_3"
          name: "node_MatMul_1_2_Q4"
          op_type: "MatMulNBits"
          attribute {
            name: "K"
            i: 1024
            type: INT
          }
          attribute {
            name: "N"
            i: 3072
            type: INT
          }
          attribute {
            name: "bits"
            i: 4
            type: INT
          }
          attribute {
            name: "block_size"
            i: 32
            type: INT
          }
          domain: "com.microsoft"
        }
        node {
          input: "val_1_3"
          input: "audio_projection.vision.0.bias"
          output: "gelu_2"
          name: "Gelu_AddBias_1"
          op_type: "BiasGelu"
          domain: "com.microsoft"
        }
        node {
          input: "gelu_2"
          input: "audio_projection.vision.2.weight_Q4"
          input: "audio_projection.vision.2.weight_scales"
          output: "val_3_3"
          name: "node_MatMul_5_2_Q4"
          op_type: "MatMulNBits"
          attribute {
            name: "K"
            i: 3072
            type: INT
          }
          attribute {
            name: "N"
            i: 3072
            type: INT
          }
          attribute {
            name: "bits"
            i: 4
            type: INT
          }
          attribute {
            name: "block_size"
            i: 32
            type: INT
          }
          domain: "com.microsoft"
        }
        node {
          input: "val_3_3"
          input: "audio_projection.vision.2.bias"
          output: "linear_1_false_graph_0"
          name: "node_Add_6_3"
          op_type: "Add"
        }
        name: "false_graph_0"
        output {
          name: "linear_1_false_graph_0"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "val_1_3"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "linear_194"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "const_cast_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
              }
            }
          }
        }
        value_info {
          name: "inner_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "erf_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "int64_1_cast_3"
          type {
            tensor_type {
              elem_type: 10
              shape {
              }
            }
          }
        }
        value_info {
          name: "inner_0_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "inner_1_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "const_2_cast_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
              }
            }
          }
        }
        value_info {
          name: "gelu_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "val_3_3"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
    attribute {
      name: "then_branch"
      g {
        node {
          input: "view_104"
          input: "audio_projection.speech.0.weight_Q4"
          input: "audio_projection.speech.0.weight_scales"
          output: "val_1_2"
          name: "node_MatMul_1_Q4"
          op_type: "MatMulNBits"
          attribute {
            name: "K"
            i: 1024
            type: INT
          }
          attribute {
            name: "N"
            i: 3072
            type: INT
          }
          attribute {
            name: "bits"
            i: 4
            type: INT
          }
          attribute {
            name: "block_size"
            i: 32
            type: INT
          }
          domain: "com.microsoft"
        }
        node {
          input: "val_1_2"
          input: "audio_projection.speech.0.bias"
          output: "gelu"
          name: "Gelu_AddBias_0"
          op_type: "BiasGelu"
          domain: "com.microsoft"
        }
        node {
          input: "gelu"
          input: "audio_projection.speech.2.weight_Q4"
          input: "audio_projection.speech.2.weight_scales"
          output: "val_3_2"
          name: "node_MatMul_5_Q4"
          op_type: "MatMulNBits"
          attribute {
            name: "K"
            i: 3072
            type: INT
          }
          attribute {
            name: "N"
            i: 3072
            type: INT
          }
          attribute {
            name: "bits"
            i: 4
            type: INT
          }
          attribute {
            name: "block_size"
            i: 32
            type: INT
          }
          domain: "com.microsoft"
        }
        node {
          input: "val_3_2"
          input: "audio_projection.speech.2.bias"
          output: "linear_1_true_graph_0"
          name: "node_Add_6_2"
          op_type: "Add"
        }
        name: "true_graph_0"
        output {
          name: "linear_1_true_graph_0"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "val_1_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "linear_193"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "const_cast"
          type {
            tensor_type {
              elem_type: 10
              shape {
              }
            }
          }
        }
        value_info {
          name: "inner"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "erf"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "int64_1_cast_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
              }
            }
          }
        }
        value_info {
          name: "inner_0"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "inner_1"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "const_2_cast"
          type {
            tensor_type {
              elem_type: 10
              shape {
              }
            }
          }
        }
        value_info {
          name: "gelu"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
        value_info {
          name: "val_3_2"
          type {
            tensor_type {
              elem_type: 10
              shape {
                dim {
                  dim_param: "s0"
                }
                dim {
                  dim_param: "(((s1 - 1)//8)) + 1"
                }
                dim {
                  dim_value: 3072
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
  }
  node {
    input: "sub"
    input: "encoder.encoder_embedding.global_invstd"
    output: "mul_7"
    name: "node_Mul_24"
    op_type: "Mul"
  }
  node {
    input: "sum_1"
    output: "_to_copy_3"
    name: "node_Cast_138"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_46"
    output: "val_47"
    name: "node_Reshape_105"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_49"
    output: "val_50"
    name: "node_Reshape_122"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_64"
    output: "val_65"
    name: "node_Reshape_146"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_4"
    output: "val_67"
    name: "node_Equal_151"
    op_type: "Equal"
  }
  node {
    input: "sym_size_int_473"
    input: "val_4"
    output: "gt_2"
    name: "node_Greater_189"
    op_type: "Greater"
  }
  node {
    input: "sym_size_int_473"
    input: "val_89"
    output: "val_90"
    name: "node_Reshape_191"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_98"
    output: "val_99"
    name: "node_Reshape_204"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_105"
    output: "val_106"
    name: "node_Reshape_223"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_153"
    output: "val_154"
    name: "node_Reshape_318"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_160"
    output: "val_161"
    name: "node_Reshape_329"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_4"
    output: "eq_240"
    name: "node_Equal_337"
    op_type: "Equal"
  }
  node {
    input: "sym_size_int_473"
    input: "val_164"
    output: "val_165"
    name: "node_Reshape_346"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_3479"
    output: "val_3480"
    name: "node_Reshape_5669"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "val_3506"
    output: "val_3507"
    name: "node_Reshape_5704"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_2"
    input: "sym_size_int_474"
    output: "add_8604"
    name: "node_Add_6"
    op_type: "Add"
  }
  node {
    input: "sym_size_int_474"
    output: "val_6"
    name: "node_Cast_25"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "mul_7"
    input: "dim_0_6"
    output: "unsqueeze_5"
    name: "n2_8"
    op_type: "Unsqueeze"
  }
  node {
    input: "_to_copy_3"
    input: "val_62"
    output: "div"
    name: "n0_10"
    op_type: "Div"
  }
  node {
    input: "val_47"
    input: "val_29"
    input: "val_29"
    output: "val_48"
    name: "node_Concat_106"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_65"
    input: "val_29"
    output: "val_66"
    name: "node_Concat_147"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_67"
    output: "ne_6"
    name: "node_Not_152"
    op_type: "Not"
  }
  node {
    input: "val_154"
    input: "val_29"
    input: "val_29"
    output: "val_155"
    name: "node_Concat_319"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_161"
    input: "val_29"
    output: "val_162"
    name: "node_Concat_330"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_3480"
    input: "val_29"
    input: "val_341"
    output: "val_3481"
    name: "node_Concat_5670"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_3507"
    input: "val_29"
    output: "val_3508"
    name: "node_Concat_5705"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "add_8604"
    input: "val_3"
    output: "floordiv_3"
    name: "node_Div_8"
    op_type: "Div"
  }
  node {
    input: "val_6"
    input: "val_7"
    output: "truediv"
    name: "node_Div_27"
    op_type: "Div"
  }
  node {
    input: "unsqueeze_5"
    input: "encoder.embed.conv.0.weight"
    input: "encoder.embed.conv.0.bias"
    output: "conv2d"
    name: "node_Conv_111"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "div"
    output: "ceil_1"
    name: "node_Ceil_141"
    op_type: "Ceil"
  }
  node {
    input: "val_48"
    output: "size_1_2"
    name: "n1_8"
    op_type: "Abs"
  }
  node {
    input: "val_66"
    output: "size_1_3"
    name: "n1_10"
    op_type: "Abs"
  }
  node {
    input: "ne_6"
    output: "val_118"
    name: "node_Cast_240"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "val_155"
    output: "size_1_5"
    name: "n1_24"
    op_type: "Abs"
  }
  node {
    input: "val_162"
    output: "size_1_6"
    name: "n1_25"
    op_type: "Abs"
  }
  node {
    input: "val_3508"
    output: "size_1_7"
    name: "n1_34"
    op_type: "Abs"
  }
  node {
    input: "val_4"
    input: "floordiv_3"
    output: "add_8605"
    name: "node_Add_10"
    op_type: "Add"
  }
  node {
    input: "val_4"
    input: "floordiv_3"
    output: "add_8607"
    name: "node_Add_16"
    op_type: "Add"
  }
  node {
    input: "truediv"
    output: "val_8"
    name: "node_Ceil_28"
    op_type: "Ceil"
  }
  node {
    input: "conv2d"
    output: "relu"
    name: "node_Relu_112"
    op_type: "Relu"
  }
  node {
    input: "ceil_1"
    output: "_to_copy_4"
    name: "node_Cast_142"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "add_8605"
    input: "val_5"
    output: "mod_3"
    name: "node_Mod_12"
    op_type: "Mod"
    attribute {
      name: "fmod"
      i: 0
      type: INT
    }
  }
  node {
    input: "add_8605"
    input: "val_51"
    output: "val_52"
    name: "node_Reshape_124"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_13"
    input: "add_8605"
    input: "val_63"
    output: "arange_2"
    name: "node_Range_144"
    op_type: "Range"
  }
  node {
    input: "sym_size_int_473"
    input: "add_8605"
    output: "mul_132"
    name: "node_Mul_167"
    op_type: "Mul"
  }
  node {
    input: "add_8605"
    input: "val_100"
    output: "val_101"
    name: "node_Reshape_206"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "add_8605"
    input: "val_204"
    output: "val_209"
    name: "node_Unsqueeze_395"
    op_type: "Unsqueeze"
  }
  node {
    input: "add_8605"
    input: "val_5"
    output: "gt_7"
    name: "node_Greater_428"
    op_type: "Greater"
  }
  node {
    input: "add_8605"
    input: "val_264"
    output: "val_265"
    name: "node_Reshape_466"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_271"
    input: "add_8605"
    input: "val_272"
    output: "arange_6"
    name: "node_Range_479"
    op_type: "Range"
  }
  node {
    input: "val_284"
    input: "add_8605"
    input: "val_285"
    output: "arange_7"
    name: "node_Range_495"
    op_type: "Range"
  }
  node {
    input: "val_3504"
    input: "add_8605"
    input: "val_3505"
    output: "arange_8"
    name: "node_Range_5702"
    op_type: "Range"
  }
  node {
    input: "val_8"
    output: "ceil"
    name: "node_Cast_29"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "relu"
    input: "encoder.embed.conv.2.weight"
    input: "encoder.embed.conv.2.bias"
    output: "conv2d_1"
    name: "node_Conv_113"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1024
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "_to_copy_4"
    input: "dim_0_7"
    output: "unsqueeze_6"
    name: "n2_10"
    op_type: "Unsqueeze"
  }
  node {
    input: "val_2"
    input: "mod_3"
    output: "mul_6474"
    name: "node_Mul_13"
    op_type: "Mul"
  }
  node {
    input: "val_50"
    input: "val_52"
    input: "val_53"
    output: "val_54"
    name: "node_Concat_126"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "arange_2"
    input: "size_1_3"
    output: "expand_2"
    name: "n2_9"
    op_type: "Expand"
  }
  node {
    input: "mul_132"
    input: "val_75"
    output: "val_76"
    name: "node_Reshape_169"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_99"
    input: "val_59"
    input: "val_101"
    output: "val_102"
    name: "node_Concat_207"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "gt_7"
    output: "val_238"
    name: "node_Cast_429"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "arange_6"
    input: "dim_0_17"
    output: "unsqueeze_16"
    name: "n2_26"
    op_type: "Unsqueeze"
  }
  node {
    input: "arange_7"
    input: "dim_0_18"
    output: "unsqueeze_17"
    name: "n2_27"
    op_type: "Unsqueeze"
  }
  node {
    input: "arange_8"
    input: "size_1_7"
    output: "expand_6"
    name: "n2_31"
    op_type: "Expand"
  }
  node {
    input: "ceil"
    input: "val_9"
    output: "val_10"
    name: "node_Unsqueeze_37"
    op_type: "Unsqueeze"
  }
  node {
    input: "val_13"
    input: "ceil"
    input: "val_12"
    output: "arange"
    name: "node_Range_43"
    op_type: "Range"
  }
  node {
    input: "val_13"
    input: "ceil"
    input: "val_26"
    output: "arange_1"
    name: "node_Range_66"
    op_type: "Range"
  }
  node {
    input: "ceil"
    input: "val_27"
    output: "val_28"
    name: "node_Reshape_69"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "sym_size_int_473"
    input: "ceil"
    output: "mul_137"
    name: "node_Mul_174"
    op_type: "Mul"
  }
  node {
    input: "ceil"
    input: "val_91"
    output: "val_92"
    name: "node_Reshape_193"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "ceil"
    input: "val_93"
    output: "val_94"
    name: "node_Reshape_195"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "ceil"
    input: "val_198"
    output: "val_199"
    name: "node_Reshape_384"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "ceil"
    input: "val_216"
    output: "val_221"
    name: "node_Unsqueeze_408"
    op_type: "Unsqueeze"
  }
  node {
    input: "ceil"
    input: "val_254"
    output: "val_255"
    name: "node_Reshape_455"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "conv2d_1"
    input: "encoder.embed.conv.3.weight"
    input: "encoder.embed.conv.3.bias"
    output: "conv2d_2"
    name: "node_Conv_114"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "val_5"
    input: "mul_6474"
    output: "add_8606"
    name: "node_Add_14"
    op_type: "Add"
  }
  node {
    input: "expand_2"
    input: "unsqueeze_6"
    output: "lt_6"
    name: "node_Less_150"
    op_type: "Less"
  }
  node {
    input: "unsqueeze_17"
    input: "unsqueeze_16"
    output: "sub_312"
    name: "node_Sub_508"
    op_type: "Sub"
  }
  node {
    input: "expand_6"
    input: "unsqueeze_19"
    output: "lt_24"
    name: "node_Less_5709"
    op_type: "Less"
  }
  node {
    input: "_to_copy"
    input: "val_10"
    output: "cat_1"
    name: "node_Concat_39"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "arange"
    input: "dim_0"
    output: "unsqueeze"
    name: "n2"
    op_type: "Unsqueeze"
  }
  node {
    input: "arange_1"
    input: "dim_0_2"
    output: "unsqueeze_1"
    name: "n2_2"
    op_type: "Unsqueeze"
  }
  node {
    input: "val_28"
    input: "val_29"
    output: "val_30"
    name: "node_Concat_71"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "mul_137"
    input: "ceil"
    output: "mul_138"
    name: "node_Mul_175"
    op_type: "Mul"
  }
  node {
    input: "val_90"
    input: "val_92"
    input: "val_94"
    output: "val_95"
    name: "node_Concat_196"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "conv2d_2"
    output: "relu_1"
    name: "node_Relu_115"
    op_type: "Relu"
  }
  node {
    input: "add_8606"
    input: "val_5"
    output: "mod_4"
    name: "node_Mod_15"
    op_type: "Mod"
    attribute {
      name: "fmod"
      i: 0
      type: INT
    }
  }
  node {
    input: "lt_6"
    output: "val_68"
    name: "node_Shape_153"
    op_type: "Shape"
    attribute {
      name: "start"
      i: 0
      type: INT
    }
  }
  node {
    input: "sub_312"
    input: "val_296"
    output: "lt_21"
    name: "node_Less_510"
    op_type: "Less"
  }
  node {
    input: "lt_24"
    output: "val_3509"
    name: "node_NonZero_5710"
    op_type: "NonZero"
  }
  node {
    input: "cat_1"
    output: "val_39"
    name: "node_Transpose_92"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "unsqueeze"
    input: "cat_1"
    output: "lt"
    name: "node_Less_45"
    op_type: "Less"
  }
  node {
    input: "unsqueeze"
    input: "cat"
    output: "ge"
    name: "node_GreaterOrEqual_46"
    op_type: "GreaterOrEqual"
  }
  node {
    input: "val_30"
    output: "size_1"
    name: "n1_4"
    op_type: "Abs"
  }
  node {
    input: "mul_138"
    input: "val_85"
    output: "val_86"
    name: "node_Reshape_184"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "mul_138"
    input: "val_13"
    output: "eq_134"
    name: "node_Equal_202"
    op_type: "Equal"
  }
  node {
    input: "relu_1"
    input: "encoder.embed.conv.5.weight"
    input: "encoder.embed.conv.5.bias"
    output: "conv2d_3"
    name: "node_Conv_116"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1024
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "add_8607"
    input: "mod_4"
    output: "add_8608"
    name: "node_Add_17"
    op_type: "Add"
  }
  node {
    input: "mod_4"
    input: "val_107"
    output: "val_108"
    name: "node_Reshape_225"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "ne_6"
    input: "val_68"
    output: "full_like"
    name: "node_Expand_154"
    op_type: "Expand"
  }
  node {
    input: "lt_21"
    input: "val_297"
    input: "sub_312"
    output: "masked_fill"
    name: "node_Where_512"
    op_type: "Where"
  }
  node {
    input: "val_3509"
    output: "val_3510"
    name: "node_Transpose_5711"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    input: "lt"
    input: "ge"
    output: "bitwise_and"
    name: "node_And_47"
    op_type: "And"
  }
  node {
    input: "unsqueeze_1"
    input: "size_1"
    output: "expand"
    name: "n2_3"
    op_type: "Expand"
  }
  node {
    input: "conv2d_3"
    input: "encoder.embed.conv.6.weight"
    input: "encoder.embed.conv.6.bias"
    output: "conv2d_4"
    name: "node_Conv_117"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "add_8608"
    input: "val_5"
    output: "floordiv_4"
    name: "node_Div_19"
    op_type: "Div"
  }
  node {
    input: "add_8608"
    input: "val_120"
    output: "val_121"
    name: "node_Unsqueeze_253"
    op_type: "Unsqueeze"
  }
  node {
    input: "val_13"
    input: "add_8608"
    input: "val_122"
    output: "arange_3"
    name: "node_Range_257"
    op_type: "Range"
  }
  node {
    input: "val_13"
    input: "add_8608"
    input: "val_135"
    output: "arange_4"
    name: "node_Range_281"
    op_type: "Range"
  }
  node {
    input: "add_8608"
    input: "val_136"
    output: "val_137"
    name: "node_Reshape_284"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_13"
    input: "add_8608"
    input: "val_159"
    output: "arange_5"
    name: "node_Range_327"
    op_type: "Range"
  }
  node {
    input: "add_8608"
    input: "val_166"
    output: "val_167"
    name: "node_Reshape_348"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "add_8608"
    input: "val_168"
    output: "val_169"
    name: "node_Reshape_350"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "val_106"
    input: "val_108"
    output: "val_109"
    name: "node_Concat_226"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "lt_6"
    input: "full_like"
    output: "mul_127"
    name: "node_And_156"
    op_type: "And"
  }
  node {
    input: "masked_fill"
    input: "val_298"
    output: "gt_8"
    name: "node_Greater_514"
    op_type: "Greater"
  }
  node {
    input: "getitem_96"
    input: "val_3510"
    output: "index_6"
    name: "node_GatherND_5712"
    op_type: "GatherND"
    attribute {
      name: "batch_dims"
      i: 0
      type: INT
    }
  }
  node {
    input: "bitwise_and"
    output: "tmp"
    name: "n0_2"
    op_type: "NonZero"
  }
  node {
    input: "conv2d_4"
    output: "relu_2"
